Consider following code to answer further questions:
import pandas as pd
course_name = [‘Data Science’, ‘Machine Learning’, ‘Big Data’, ‘Data Engineer’]
duration = [2,3,6,4]
df = pd.DataFrame(data = {‘course_name’ : course_name, ‘duration’ : duration})

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [3]:
import pandas as pd
course_name = ["Data Science", "Machine Learning", "Big Data", "Data Engineer"]
duration = [2,3,6,4]
df = pd.DataFrame(data = {"course_name" : course_name, "duration" : duration})

In [4]:
df
data = {"course_name" : course_name, "duration" : duration}

In [5]:
df[1:2]

        course_name  duration
1  Machine Learning         3

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

Difference between loc and iloc is that in loc we can access the values of data inside the data frame by just giving the column names , where else in iloc we can aceess the the values through index the columns starting from zero for example given below

In [6]:
df.iloc[0,1]

2

In [7]:
df.loc[1,"course_name"]

'Machine Learning'

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].

In [8]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [9]:

reindex=[3,0,1,2]

new_df=pd.DataFrame(data,index=reindex)

In [10]:
new_df

        course_name  duration
3      Data Science         2
0  Machine Learning         3
1          Big Data         6
2     Data Engineer         4

In [11]:
new_df.loc[2,"duration"]

4

In [16]:
new_df.iloc[2,0]

'Big Data'

the difference between loc and iloc as from the above example is that in loc it gives the result according to the row index where else in i loc it gives according to the the by default index

Consider the below code to answer further questions:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [17]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [18]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.976756  0.565535  0.330134  0.210694  0.202082  0.567097
2  0.680250  0.316158  0.303624  0.740083  0.966767  0.911577
3  0.943988  0.165738  0.755966  0.493859  0.590845  0.083493
4  0.506185  0.227961  0.428883  0.933625  0.247541  0.786808
5  0.597570  0.258452  0.295435  0.279007  0.729786  0.191342
6  0.323192  0.330677  0.114910  0.779696  0.963044  0.027837

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [25]:
df1.describe()[1:2]

      column_1  column_2  column_3  column_4  column_5  column_6
mean  0.671324  0.310753  0.371492  0.572827  0.616677  0.428026

In [27]:
df1.describe()[2:3]

     column_1  column_2  column_3  column_4  column_5  column_6
std  0.253622  0.138535  0.214033  0.291428    0.3359  0.378618

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [28]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.976756  0.565535  0.330134  0.210694  0.202082  0.567097
2  0.680250  0.316158  0.303624  0.740083  0.966767  0.911577
3  0.943988  0.165738  0.755966  0.493859  0.590845  0.083493
4  0.506185  0.227961  0.428883  0.933625  0.247541  0.786808
5  0.597570  0.258452  0.295435  0.279007  0.729786  0.191342
6  0.323192  0.330677  0.114910  0.779696  0.963044  0.027837

In [33]:
df1.loc[2,"column_2"]="dassu"

In [34]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.976756  0.565535  0.330134  0.210694  0.202082  0.567097
2  0.680250     dassu  0.303624  0.740083  0.966767  0.911577
3  0.943988  0.165738  0.755966  0.493859  0.590845  0.083493
4  0.506185  0.227961  0.428883  0.933625  0.247541  0.786808
5  0.597570  0.258452  0.295435  0.279007  0.729786  0.191342
6  0.323192  0.330677  0.114910  0.779696  0.963044  0.027837

In [36]:
df1.groupby("column_2")

In [37]:
df1.mean()

/tmp/ipykernel_400/2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

column_1    0.671324
column_3    0.371492
column_4    0.572827
column_5    0.616677
column_6    0.428026
dtype: float64

so it is not able to calculate the mean of column_2 because it consists of string data , and we cannot calcualte the mean of string value , it is applied on numerical (integer) values only.1

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

In pandas, the windows functions are a group of operations that allow you to perform calculations and transformations on a specific subset of data within a sliding window

Rolling Window Functions:

Rolling window functions operate on a fixed-size sliding window of data.
They compute statistics or apply transformations to the values within the window.
The window moves forward by one observation at a time.

Expanding Window Functions:

Expanding window functions calculate statistics or apply transformations to an expanding window of data.
The window starts from the beginning of the data and grows with each new observation.
These functions can help track the cumulative values or growth over time.

Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [42]:
current_date_time=pd.to_datetime('today')

In [45]:
print(f"Current month of this year is {current_date_time.month}")

Current month of this year is 6

In [46]:
print(f"Current month of this year is {current_date_time.year}")

Current month of this year is 2023

In [51]:
print(f"Current day of this year is {current_date_time.day}")

Current day of this year is 24

In [54]:
print(f"Current time of this year is {current_date_time.ctime()}")

Current time of this year is Sat Jun 24 12:17:24 2023

In [66]:
print(f"Current date of this year is {current_date_time.date()}")

Current date of this year is 2023-06-24

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [70]:
import pandas as pd

# Prompt the user to enter the dates
start_date = input("Enter the start date (YYYY-MM-DD): ")
end_date = input("Enter the end date (YYYY-MM-DD): ")

# Convert the input dates to pandas datetime objects
start_date = pd.to_datetime(start_date)
end_date = pd.to_datetime(end_date)

# Calculate the difference between the dates
time_difference = end_date - start_date

# Extract the days, hours, and minutes from the time difference
days = time_difference.days
hours = time_difference.seconds // 3600
minutes = (time_difference.seconds // 60) % 60

# Display the result
print("Time difference:")
print(f"Days: {days}")
print(f"Hours: {hours}")
print(f"Minutes: {minutes}")

Enter the start date (YYYY-MM-DD):  2023-06-01
Enter the end date (YYYY-MM-DD):  2023-06-07

Time difference:
Days: 6
Hours: 0
Minutes: 0

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.